tutorials/consistentSolvers/consistentPimpleDyMFoam/cavityBlock/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object controlDict;
}

libs ("libextraSolidBodyMotion.so" "libboundaryConditions.so")

application consistentPimpleDyMFoam;

startFrom startTime;

startTime 0.0;

stopAt endTime;

endTime 0.5;

deltaT 0.005;

writeControl timeStep;

writeInterval 10;

purgeWrite 0;

writeFormat ascii;

writePrecision 8;

writeCompression compressed;

timeFormat general;

timePrecision 6;

graphFormat raw;

runTimeModifiable no;

adjustTimeStep no;

maxCo 0.5;

maxDeltaT 0.25;
// ************************************************************************* //
